{"description": "Fonctionnalités avancées BOB.\n\t 1. Module Distribution : sur les pages A Attribuer Technique, Administratif et Recherche Avancée : extraction des demandes, attribution depuis un fichier source (macro Xcel)\n\t 2. Module Premier Examen : Ajout de champs CIB en une ligne, ouverture des pièces PDF de la demande en un clic.\n\t 3. Module RRP : Importation automatique de RRP depuis un fichier source (macro Xcel)\n\t 4. Module Délivrance : Ouverture des documents cités par le RRP dans EPOQUENet, génération automatique d'une feuille de suivi\n\n\n Changements:\n\t 2.2.5.1  Extraction PE sans les déchus, déselection des demandes avant la sélection pour attribution du prochain examinateur \n\t 2.2.5  Examen délivrance : Pré-examen des délivrances post-Pacte. \n\t 2.2.4.5  Examen délivrance : export des documents non brevet vers Epoque. \n\t 2.2.4.4 Nouvelle délivrance : notification sur revendication ajouté, Modifier plusieurs documents du bloc document : Ajout du type \n\t 2.2.4.3 Extraction: demandes provisoires \n\t 2.2.4.2 RRP: parties pertinentes \n\t 2.2.4 fin 2.2.3.2 \n\t 2.2.3.2 Changement du nom des CSV, ajout des corbeilles délivrance, ajout de « mes corbeilles » \n\t 2.2.3.1 Corrections for extraction of granting exam meta data. \n\t 2.2.3 User basket management corrections\n\t 2.1.2 Options page ameliorations \n\t 2.1.2 http=>https. \n\t 2.1.2 Corrections mineures pour la récupération des corbeilles. \n\t 2.2.1 Extraction des corbeilles utilisateur avec sauvegarde des options.\n\t 2.0 Création d'une extraction automatique des données de la page d'un dossier pour remplir une feuille de délivrance. \n\t 1.9.6.2 Correction bug modif. documents. \n\t 1.9.6.1 Filtre pour l'extraction en recherche avancée. 1.9.6 a. Module CIB : possibilité de ne pas répéter le sous-groupe.\n\t b. Filtrage des demandes en délivrance lors de l'extraction pour distribution.\n\t 1.9.5 Ajout d'une fonctionnalité de navigation dans la page lors du click sur l'un des modules.\n\t 1.9.4 Corrections du module modification des documents.\n\t 1.9.3 Ajout d'une fonctionnalité de modification des documents du bloc document.\n\t1.9.2 Correctifs extraction des demandes administratives.\n\t 1.9.1 Extraction des demandes sans les demandes rejetées.\n\t 1.9 Gestion de la littérature non brevet.\n\t 1.8.2 Module pour ouvrir les pdfs relatifs au RRP.\n\t 1.8.1 Corrections CIB.\n\t 1.8 Réorganisation du pop-up, \n\t\t  Module Distribution : correctifs pour les titres\n\t\t Module Premier Examen : ajout d'un bouton pour ouvrir les pdf des pièces de la demande.\n\t\t Module Délivrance : ouverture dans EpoqueNet en un clic.\n\t\t Module RRP : amélioration de la robustesse de la lecture du fichier d'entrée.\n\t 1.7.3 Module Distribution : Intégration du tri des demandes à la lecture du fichier.\n\t 1.7.2 Module CIB : traitement automatique de la casse et des espaces.\n\t 1.7.1 module Distribution possible sur pages d'attribution administratif.\n\t 1.7 ajout d'un module CIB pour ajouter la CIB en une ligne, séparée par des virgule et/ou des point-virgules.\n\t 1.6.2 : Corrections pour le module DEL\n\t 1.6.1 : Corrections pour le module DEL : ouvre aussi la demande, ouvre les familles de documents et non uniquement les documents avec leur type.\n\t 1.6 : Ajout d'un module pour la délivrance : ouverture automatique des documents du RRP dans EPOQNet.\n\t 1.5.2 : Message d'erreur pour la distribution si l'attribution échoue pour un examinateur.\n\t 1.5.1 : Affichage du numéro de version dans le POPUP\n\t 1.5 : modification du format de fichier d'entrée des RRP (format JSON), import des informations de catégorie des documents cités, import des parties pertinentes", "manifest_version": 2, "name": "BOB Toolkit", "version": "2.2.5.1", "homepage_url": "http://intra.inpi.net/inpi/pii_195979", "icons": {"48": "icons/bob-48.png", "96": "icons/bob-96.png"}, "options_ui": {"page": "settings/options.html", "open_in_tab": true, "browser_style": true}, "permissions": ["activeTab", "storage"], "browser_action": {"default_icon": "icons/bob-32.png", "theme_icons": [{"light": "icons/bob-32-light.png", "dark": "icons/bob-32.png", "size": 32}], "default_title": "BOB toolkit", "default_popup": "popup/choose_module.html"}, "web_accessible_resources": ["icons/goback32.png"], "browser_specific_settings": {"gecko": {"id": "{9c15deaf-dfa4-4975-8687-7076e2291e20}"}}}