{"name": "FireEye iSIGHT Browser Extension", "version": "2.1.1", "developer": {"name": "FireEye", "url": "https://addons.mozilla.org/en-US/firefox/user/abhimani"}, "homepage_url": "https://www.isightpartners.com", "description": "Find and validate cyber threat intelligence information in any web content with dynamic linking into FireEye iSIGHT intelligence.\n\n     Finds IPs, Domains, MD5, SHA256, SHA1, fuzzy hashes and file names in web pages and matches to FireEye iSIGHT intelligence.\n\n     The Browser Extension will enable all customers to connect the data that they’re viewing in their web browser, regardless of the tool or site, to the full intelligence context provided by FireEye. This will allow customers to connect to FireEye intelligence context from Internet databases, such as VirusTotal or WHOIS, which otherwise was not possible to integrate.\n\n\n     You'll need to enter your FireEye iSIGHT API 2.0 credentials/keys to make the plugin operational. For that you'll have to right click on the icon & select Options which will then open a dialog where you'll have to enter your credentials/keys.\n\n\n     Clicking on the icon will detect IP addresses, domains & file hashes etc. on a displayed web page. It will parse the entire webpage or just the selection for the observables/indicators and will highlight them. Parsing of the entire webpage or just the selection is based on the configuration in the option dialog.\n\n\n     After that it will match the observables/indicators with FireEye iSIGHT API 2.0 interface and highlight the ones that are matched. On mouse over of these matched observables/indicators, FireEye icon will appear which when clicked will call to FIIP in order to allow customers quick access to our intelligence for context around whatever issue they are investigating.\n\n\n     Also you have the option to just directly select the observable/indicator and redirect it to FIIP.\n\n\n     If the indicator/observable is matched to any one report then the clicking on the FireEye icon will take you to that particular report directly. Or else if it is matched in more than one report then you'll get redirected to the FIIP search page.", "icons": {"16": "img/isight-logo-red.png", "48": "img/isight-logo-red48.png", "128": "img/isight-logo-red128.png"}, "content_scripts": [{"matches": ["<all_urls>"], "css": ["css/style.css"], "js": ["js/jquery-3.3.1.min.js", "js/jquery-migrate-3.0.1.js", "js/highlight.js", "js/threat-verifier.js", "js/iSIGHTContentScript.js"], "all_frames": true}], "permissions": ["notifications", "tabs", "contextMenus", "*://*/*"], "background": {"scripts": ["js/background.js"]}, "browser_action": {"default_title": "Threat-data", "default_icon": "img/isight-logo-red.png", "default_popup": "choose_page.html", "browser_style": true}, "web_accessible_resources": ["img/isight-logo-red.png", "img/logo-isight.png", "css/style.css", "css/options.css", "options.html"], "manifest_version": 2, "options_ui": {"page": "options.html", "open_in_tab": true}, "content_security_policy": "script-src 'self'; object-src 'self'"}